app/views/sub_races/_form.html.erb

    <div class="col-lg-10" >
      <%= f.select :race_id, Race.all.collect {|x| [x.name, x.id]}, {}, class: "form-control race"%>
---
SELECT "races"."name", "races"."id" FROM "races"