app/views/characters/_form.html.erb

SELECT "races".* FROM "races"
---
    <div class="col-lg-10">
      <%= f.select :race_id, Race.all.collect {|x| [x.name, x.id]}, {}, class: "form-control race"%>