app/controllers/backgrounds_controller.rb

  def index
    @backgrounds = Background.all
---
SELECT "backgrounds".* FROM "backgrounds"