app/controllers/characters_controller.rb

SELECT "races".* FROM "races" WHERE "races"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def by_race
    @race = Race.find(params[:race_id])