app/controllers/class_jobs_controller.rb

  def index
    @class_jobs = ClassJob.all
---
SELECT "class_jobs".* FROM "class_jobs"