app/controllers/races_controller.rb

SELECT "races".* FROM "races"
---
  def index
    @races = Race.all

INSERT INTO "races" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Anão"], ["created_at", "2021-09-10 13:28:49.458375"], ["updated_at", "2021-09-10 13:28:49.458375"]]
---
  def create
    @race = Race.new(race_params)

    respond_to do |format|
      if @race.save

SELECT "races".* FROM "races" WHERE "races"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_race
      @race = Race.find(params[:id])