app/controllers/sub_class_jobs_controller.rb

  def index
    @sub_class_jobs = SubClassJob.all
---
SELECT "sub_class_jobs".* FROM "sub_class_jobs"