app/controllers/sub_races_controller.rb

SELECT "sub_races".* FROM "sub_races"
---
  def index
    @sub_races = SubRace.all

INSERT INTO "sub_races" ("name", "race_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Colinas"], ["race_id", 1], ["created_at", "2021-09-10 13:35:25.790521"], ["updated_at", "2021-09-10 13:35:25.790521"]]
---
  def create
    @sub_race = SubRace.new(sub_race_params)

    respond_to do |format|
      if @sub_race.save

DELETE FROM "sub_races" WHERE "sub_races"."id" = $1  [["id", 2]]
---
  def destroy
    @sub_race.destroy

SELECT "sub_races".* FROM "sub_races" WHERE "sub_races"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_sub_race
      @sub_race = SubRace.find(params[:id])